
## Terraform plan for environment: `dev`

**Commit:** 50f379c2023ced63fd0c9a30dc1b1c2245ee822f


**API version:** 988f85a
**Selfserve version:** 988f85a
**Internal version:** 988f85a

### Plan summary

`9 to add, 2 to change, 2 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudwatch_log_group.this
module.service.module.batch.aws_batch_compute_environment.this["fargate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue"]
module.service.module.batch.aws_batch_job_queue.this["high_priority"]
module.service.module.batch.aws_batch_job_queue.this["low_priority"]
module.service.module.batch.aws_iam_instance_profile.instance[0]
module.service.module.batch.aws_iam_role.instance[0]
module.service.module.batch.aws_iam_role.service[0]
module.service.module.batch.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"]
```
**🗑️ Deletes**

```tf
module.service.module.batch.aws_batch_job_definition.this["job_configuration"]
module.service.module.batch.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_scheduling_policy.this["high_priority"]
module.service.module.batch.aws_batch_scheduling_policy.this["low_priority"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.service.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_compute_environment.this["fargate"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "vol-app-dev-fargate-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = (known after apply)
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + max_vcpus          = 4
          + security_group_ids = [
              + "sg-c5b527a1",
            ]
          + subnets            = [
              + "subnet-0516482542b236301",
              + "subnet-05933d7aef9cd4195",
              + "subnet-085356c74213846bd",
            ]
          + type               = "FARGATE"

          + ec2_configuration (known after apply)
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["job_configuration"] will be destroyed
  # (because key ["job_configuration"] is not in for_each map)
  - resource "aws_batch_job_definition" "this" {
      - arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/processQueue-job:1" -> null
      - arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/processQueue-job" -> null
      - container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas --container=/var/www/html/config/container-cli.php",
                  - "queue:process-queue",
                ]
              - environment                  = []
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:latest"
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> null
      - deregister_on_new_revision = true -> null
      - id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/processQueue-job:1" -> null
      - name                       = "processQueue-job" -> null
      - parameters                 = {} -> null
      - platform_capabilities      = [
          - "FARGATE",
        ] -> null
      - propagate_tags             = true -> null
      - revision                   = 1 -> null
      - scheduling_priority        = 0 -> null
      - tags                       = {
          - "JobDefinition" = "BatchTest"
        } -> null
      - tags_all                   = {
          - "Environment"   = "dev"
          - "JobDefinition" = "BatchTest"
          - "Repository"    = "https://github.com/dvsa/vol-app"
        } -> null
      - type                       = "container" -> null
        # (1 unchanged attribute hidden)

      - retry_strategy {
          - attempts = 3 -> null

          - evaluate_on_exit {
              - action           = "exit" -> null
              - on_exit_code     = "0" -> null
                # (2 unchanged attributes hidden)
            }
          - evaluate_on_exit {
              - action           = "retry" -> null
              - on_exit_code     = "1" -> null
                # (2 unchanged attributes hidden)
            }
        }

      - timeout {
          - attempt_duration_seconds = 60 -> null
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "process-queue"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["high_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestHighPriorityFargate"
      + priority              = 99
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestHighPriorityFargate"
      + state                 = "ENABLED"
      + tags                  = {}
      + tags_all              = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["low_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestLowPriorityFargate"
      + priority              = 1
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestLowPriorityFargate"
      + state                 = "ENABLED"
      + tags                  = {}
      + tags_all              = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_scheduling_policy.this["high_priority"] will be updated in-place
  ~ resource "aws_batch_scheduling_policy" "this" {
        id       = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestHighPriorityFargate"
        name     = "BatchTestHighPriorityFargate"
      ~ tags     = {
          - "JobQueue" = "High priority job queue" -> null
        }
      ~ tags_all = {
          - "JobQueue"    = "High priority job queue" -> null
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.batch.aws_batch_scheduling_policy.this["low_priority"] will be updated in-place
  ~ resource "aws_batch_scheduling_policy" "this" {
        id       = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestLowPriorityFargate"
        name     = "BatchTestLowPriorityFargate"
      ~ tags     = {
          - "JobQueue" = "Low priority job queue" -> null
        }
      ~ tags_all = {
          - "JobQueue"    = "Low priority job queue" -> null
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.batch.aws_iam_instance_profile.instance[0] must be replaced
+/- resource "aws_iam_instance_profile" "instance" {
      ~ arn         = "arn:aws:iam::054614622558:instance-profile/batch/dev-batch-app-ecs-instance-role-20240705091351320700000003" -> (known after apply)
      ~ create_date = "2024-07-05T09:13:51Z" -> (known after apply)
      ~ id          = "dev-batch-app-ecs-instance-role-20240705091351320700000003" -> (known after apply)
      ~ name        = "dev-batch-app-ecs-instance-role-20240705091351320700000003" -> (known after apply)
      ~ name_prefix = "dev-batch-app-ecs-instance-role-" -> "vol-app-dev-batch-instance-" # forces replacement
      ~ path        = "/batch/" -> "/" # forces replacement
      ~ role        = "dev-batch-app-ecs-instance-role-20240705091350942900000002" -> (known after apply)
      - tags        = {
          - "ModuleCreatedRole" = "Yes"
        } -> null
      ~ tags_all    = {
          - "ModuleCreatedRole" = "Yes" -> null
            # (2 unchanged elements hidden)
        }
      ~ unique_id   = "AIPAQZN2JAFPNPBMU7CF2" -> (known after apply)
    }

  # module.service.module.batch.aws_iam_role.instance[0] must be replaced
+/- resource "aws_iam_role" "instance" {
      ~ arn                   = "arn:aws:iam::054614622558:role/batch/dev-batch-app-ecs-instance-role-20240705091350942900000002" -> (known after apply)
      ~ create_date           = "2024-07-05T09:13:51Z" -> (known after apply)
      ~ description           = "IAM instance role/profile for AWS Batch ECS instance(s)" -> "Task execution role for vol-app-dev-batch"
      ~ id                    = "dev-batch-app-ecs-instance-role-20240705091350942900000002" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ] -> (known after apply)
      ~ name                  = "dev-batch-app-ecs-instance-role-20240705091350942900000002" -> (known after apply)
      ~ name_prefix           = "dev-batch-app-ecs-instance-role-" -> "vol-app-dev-batch-instance-" # forces replacement
      ~ path                  = "/batch/" -> "/" # forces replacement
      - tags                  = {
          - "ModuleCreatedRole" = "Yes"
        } -> null
      ~ tags_all              = {
          - "ModuleCreatedRole" = "Yes" -> null
            # (2 unchanged elements hidden)
        }
      ~ unique_id             = "AROAQZN2JAFPB2RD3U2TO" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # module.service.module.batch.aws_iam_role.service[0] must be replaced
+/- resource "aws_iam_role" "service" {
      ~ arn                   = "arn:aws:iam::054614622558:role/batch/dev-batch-app-batch-role-20240705091350939600000001" -> (known after apply)
      ~ create_date           = "2024-07-05T09:13:51Z" -> (known after apply)
      ~ description           = "IAM service role for AWS Batch" -> "Service role for vol-app-dev-batch"
      ~ id                    = "dev-batch-app-batch-role-20240705091350939600000001" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole",
        ] -> (known after apply)
      ~ name                  = "dev-batch-app-batch-role-20240705091350939600000001" -> (known after apply)
      ~ name_prefix           = "dev-batch-app-batch-role-" -> "vol-app-dev-batch-service-" # forces replacement
      ~ path                  = "/batch/" -> "/" # forces replacement
      - tags                  = {
          - "ModuleCreatedRole" = "Yes"
        } -> null
      ~ tags_all              = {
          - "ModuleCreatedRole" = "Yes" -> null
            # (2 unchanged elements hidden)
        }
      ~ unique_id             = "AROAQZN2JAFPP4ZJBDHSB" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # module.service.module.batch.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "instance" {
      ~ id         = "dev-batch-app-ecs-instance-role-20240705091350942900000002-20240705091351485900000005" -> (known after apply)
      ~ role       = "dev-batch-app-ecs-instance-role-20240705091350942900000002" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.service.module.batch.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "service" {
      ~ id         = "dev-batch-app-batch-role-20240705091350939600000001-20240705091351354000000004" -> (known after apply)
      ~ role       = "dev-batch-app-batch-role-20240705091350939600000001" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 10 to add, 2 to change, 6 to destroy.

```

</details>